-- make table students
CREATE TABLE "Студенты" (
    "id" SERIAL PRIMARY KEY,
    "ФИО" VARCHAR(255) NOT NULL,
    "ДатаРождения" DATE
);

-- make table courses
CREATE TABLE "Курсы" (
    "id" SERIAL PRIMARY KEY,
    "НазваниеКурса" VARCHAR(255) NOT NULL,
    "ОписаниеКурса" TEXT
);

--make connections
CREATE TABLE "Студенты_Курсы" (
    "id" SERIAL PRIMARY KEY,
    "СтудентID" INT NOT NULL,
    "КурсID" INT NOT NULL,
    "ДатаЗаписи" DATE NOT NULL DEFAULT CURRENT_DATE,
    FOREIGN KEY ("СтудентID") REFERENCES "Студенты"("id") ON DELETE CASCADE,
    FOREIGN KEY ("КурсID") REFERENCES "Курсы"("id") ON DELETE CASCADE
);

-- Тесты
-- добавим данных
INSERT INTO "Студенты" ("ФИО", "ДатаРождения") VALUES
('Иванов Иван Иванович', '2000-01-15'),
('Петров Петр Петрович', '1999-05-22'),
('Сидорова Мария Алексеевна', '2001-03-10'),
('Кузнецов Александр Сергеевич', '1998-11-30'),
('Смирнова Ольга Викторовна', '2002-07-18');

INSERT INTO "Курсы" ("НазваниеКурса", "ОписаниеКурса") VALUES
('Математика', 'Курс по высшей математике'),
('Физика', 'Курс по общей физике'),
('Программирование', 'Курс по основам программирования на Python'),
('История', 'Курс по всемирной истории'),
('Литература', 'Курс по русской литературе'),
('Биология', 'Курс по общей биологии'),
('Химия', 'Курс по органической химии'),
('Экономика', 'Курс по макроэкономике'),
('Философия', 'Курс по философии Нового времени'),
('Социология', 'Курс по основам социологии');

--Запись студента на курс:
INSERT INTO "Студенты_Курсы" ("СтудентID", "КурсID")
VALUES (1, 1);

INSERT INTO "Студенты_Курсы" ("СтудентID", "КурсID")
VALUES (1, 3);

INSERT INTO "Студенты_Курсы" ("СтудентID", "КурсID")
VALUES (1, 5);

INSERT INTO "Студенты_Курсы" ("СтудентID", "КурсID")
VALUES (2, 2);

INSERT INTO "Студенты_Курсы" ("СтудентID", "КурсID")
VALUES (2, 4);

INSERT INTO "Студенты_Курсы" ("СтудентID", "КурсID")
VALUES (2, 6);

INSERT INTO "Студенты_Курсы" ("СтудентID", "КурсID")
VALUES (3, 2);

INSERT INTO "Студенты_Курсы" ("СтудентID", "КурсID")
VALUES (3, 1);

INSERT INTO "Студенты_Курсы" ("СтудентID", "КурсID")
VALUES (3, 3);

INSERT INTO "Студенты_Курсы" ("СтудентID", "КурсID")
VALUES (3, 4);

-- Посмотрим на каие курсы записаны первые 3 студента

SELECT s."ФИО", c."НазваниеКурса"
FROM "Студенты_Курсы" sc
JOIN "Студенты" s ON sc."СтудентID" = s."id"
JOIN "Курсы" c ON sc."КурсID" = c."id"
WHERE s."id" < 4;

-- Посмотрим кто не записался на курсы
SELECT s.ФИО, s.ДатаРождения
FROM "Студенты" s
LEFT JOIN "Студенты_Курсы" sc ON s."id" = sc."СтудентID"
WHERE sc."СтудентID" IS NULL;

-- Посмотрим курсы не посещают
SELECT с.НазваниеКурса
FROM "Курсы" с
LEFT JOIN "Студенты_Курсы" sc ON с."id" = sc."СтудентID"
WHERE sc."СтудентID" IS NULL;
